#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлементов();
	УстановитьЗаголовокКоманды();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТекстДомашнегоЗадания(Команда)
	Элементы.ФормаТекстДомашнегоЗадания.Пометка = НЕ Элементы.ФормаТекстДомашнегоЗадания.Пометка;
	УстановитьВидимостьЭлементов();
	УстановитьЗаголовокКоманды();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	Элементы.Декорация1.Видимость = Элементы.ФормаТекстДомашнегоЗадания.Пометка;
КонецПроцедуры

Процедура УстановитьЗаголовокКоманды()
	Если Элементы.ФормаТекстДомашнегоЗадания.Пометка Тогда
		Элементы.ФормаТекстДомашнегоЗадания.Заголовок = "Скрыть текст задания";
	Иначе
		Элементы.ФормаТекстДомашнегоЗадания.Заголовок = "Показать текст задания";
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти
