#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТекстДомашнегоЗадания(Команда)
	Элементы.ФормаТекстДомашнегоЗадания.Пометка = НЕ Элементы.ФормаТекстДомашнегоЗадания.Пометка;
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	Элементы.Декорация1.Видимость = Элементы.ФормаТекстДомашнегоЗадания.Пометка;
КонецПроцедуры

#КонецОбласти
